gegel/onionphone/libcodecs/lpc10/voicin.c
/*       The following variables are saved from one invocation to the */
/*       next, but are not initialized with DATA statements.  This is */
/*       acceptable, because FIRST is initialized ot .TRUE., and the */
/*       first time that this subroutine is then called, they are all */
/*       given initial values. */

/*       SNR */
/*       LBVE, LBUE, FBVE, FBUE, OFBUE, OLBUE */

/*       MAXMIN is initialized on the first call, assuming that HALF */
/*       .EQ. 1 on first call.  This is how ANALYS calls this subroutine. 
*/

/*   Voicing Decision Parameter vector (* denotes zero coefficient): */

/* 	* MAXMIN */
/* 	  LBE/LBVE */
/* 	  ZC */
/* 	  RC1 */
/* 	  QS */
/* 	  IVRC2 */
/* 	  aR_B */
/* 	  aR_F */
/* 	* LOG(LBE/LBVE) */
/*  Define 2-D voicing decision coefficient vector according to the voicin
g*/
/*  parameter order above.  Each row (VDC vector) is optimized for a speci
fic*/
/*   SNR.  The last element of the vector is the constant. */
/* 	         E    ZC    RC1    Qs   IVRC2  aRb   aRf        c */

/*  The VOICE array contains the result of the linear discriminant functio
n*/
/*   (analog values).  The VOIBUF array contains the hard-limited binary 
*/
/*   voicing decisions.  The VOICE and VOIBUF arrays, according to FORTRAN
 */
/*   memory allocation, are addressed as: */

/* 	   (half-frame number, future-frame number) */

/* 	   |   Past    |  Present  |  Future1  |  Future2  | */
/* 	   | 1,0 | 2,0 | 1,1 | 2,1 | 1,2 | 2,2 | 1,3 | 2,3 |  --->  time */

/*   Update linear discriminant function history each frame: */
	if (*half == 1) {
		voice[0] = voice[2];
		voice[1] = voice[3];
		voice[2] = voice[4];
		voice[3] = voice[5];
		*maxmin = *maxamd / max(*minamd, 1.f);
	}
/*   Calculate voicing parameters twice per frame: */
	lpc10_vparms(&vwin[1], &inbuf[inbuf_offset], &lpbuf[lpbuf_offset],
		     &buflim[1], half, dither, mintau, &zc, &lbe, &fbe, &qs,
		     &rc1, &ar_b__, &ar_f__);
/*   Estimate signal-to-noise ratio to select the appropriate VDC vector. 
*/
/*   The SNR is estimated as the running average of the ratio of the */
/*   running average full-band voiced energy to the running average */
/*   full-band unvoiced energy. SNR filter has gain of 63. */
	r__1 = (*snr + *fbve / (float)max(*fbue, 1)) * 63 / 64.f;
	*snr = (float)i_nint(&r__1);
	snr2 = *snr * *fbue / max(*lbue, 1);
/*   Quantize SNR to SNRL according to VDCL thresholds. */
	snrl = 1;
	i__1 = nvdcl - 1;
	for (snrl = 1; snrl <= i__1; ++snrl) {
		if (snr2 > vdcl[snrl - 1]) {
			goto L69;
		}
	}
/*   	(Note:  SNRL = NVDCL here) */
 L69:
/*   Linear discriminant voicing parameters: */
	value[0] = *maxmin;
	value[1] = (float)lbe / max(*lbve, 1);
	value[2] = (float)zc;
	value[3] = rc1;
	value[4] = qs;
	value[5] = ivrc[2];
	value[6] = ar_b__;
	value[7] = ar_f__;
/*   Evaluation of linear discriminant function: */
	voice[*half + 3] = vdc[snrl * 10 - 1];
	for (i__ = 1; i__ <= 8; ++i__) {
		voice[*half + 3] += vdc[i__ + snrl * 10 - 11] * value[i__ - 1];
	}
/*   Classify as voiced if discriminant > 0, otherwise unvoiced */
/*   Voicing decision for current half-frame:  1 = Voiced; 0 = Unvoiced */
	if (voice[*half + 3] > 0.f) {
		voibuf[*half + 6] = 1;
	} else {
		voibuf[*half + 6] = 0;
	}
/*   Skip voicing decision smoothing in first half-frame: */
/*     Give a value to VSTATE, so that trace statements below will print 
*/
/*     a consistent value from one call to the next when HALF .EQ. 1. */
/*     The value of VSTATE is not used for any other purpose when this is 
*/
/*     true. */
	vstate = -1;
	if (*half == 1) {
		goto L99;
	}
/*   Voicing decision smoothing rules (override of linear combination): */

/* 	Unvoiced half-frames:  At least two in a row. */
/* 	-------------------- */

/* 	Voiced half-frames:    At least two in a row in one frame. */
/* 	-------------------    Otherwise at least three in a row. */
/* 			       (Due to the way transition frames are encoded) */

/* 	In many cases, the discriminant function determines how to smooth. */
/*	In the following chart, the decisions marked with a * may be overridden
.*/

/*   Voicing override of transitions at onsets: */
/* 	If a V/UV or UV/V voicing decision transition occurs within one-half 
*/
/* 	frame of an onset bounding a voicing window, then the transition is */
/* 	moved to occur at the onset. */

/* 	P	1F */
/* 	-----	----- */
/* 	0   0   0   0 */
/* 	0   0   0*  1	(If there is an onset there) */
/* 	0   0   1*  0*	(Based on 2F and discriminant distance) */
/* 	0   0   1   1 */
/* 	0   1*  0   0	(Always) */
/* 	0   1*  0*  1	(Based on discriminant distance) */
/* 	0*  1   1   0*	(Based on past, 2F, and discriminant distance) */
/* 	0   1*  1   1	(If there is an onset there) */
/* 	1   0*  0   0	(If there is an onset there) */
/* 	1   0   0   1 */
/* 	1   0*  1*  0	(Based on discriminant distance) */
/* 	1   0*  1   1	(Always) */
/* 	1   1   0   0 */
/* 	1   1   0*  1*	(Based on 2F and discriminant distance) */
/* 	1   1   1*  0	(If there is an onset there) */
/* 	1   1   1   1 */

/*   Determine if there is an onset transition between P and 1F. */
/*   OT (Onset Transition) is true if there is an onset between */
/*   P and 1F but not after 1F. */
	ot = ((obound[1] & 2) != 0 || obound[2] == 1) && (obound[3] & 1) == 0;
/*   Multi-way dispatch on voicing decision history: */
	vstate =
	    (voibuf[3] << 3) + (voibuf[4] << 2) + (voibuf[5] << 1) + voibuf[6];
	switch (vstate + 1) {
	case 1:
		goto L99;
	case 2:
		goto L1;
	case 3:
		goto L2;
	case 4:
		goto L99;
	case 5:
		goto L4;
	case 6:
		goto L5;
	case 7:
		goto L6;
	case 8:
		goto L7;
	case 9:
		goto L8;
	case 10:
		goto L99;
	case 11:
		goto L10;
	case 12:
		goto L11;
	case 13:
		goto L99;
	case 14:
		goto L13;
	case 15:
		goto L14;
	case 16:
		goto L99;
	}
 L1:
	if (ot && voibuf[7] == 1) {
		voibuf[5] = 1;
	}
	goto L99;
 L2:
	if (voibuf[7] == 0 || voice[2] < -voice[3]) {
		voibuf[5] = 0;
	} else {
		voibuf[6] = 1;
	}
	goto L99;
 L4:
	voibuf[4] = 0;
	goto L99;
 L5:
	if (voice[1] < -voice[2]) {
		voibuf[4] = 0;
	} else {
		voibuf[5] = 1;
	}
	goto L99;
/*   VOIBUF(2,0) must be 0 */
 L6:
	if (voibuf[1] == 1 || voibuf[7] == 1 || voice[3] > voice[0]) {
		voibuf[6] = 1;
	} else {
		voibuf[3] = 1;
	}
	goto L99;
 L7:
	if (ot) {
		voibuf[4] = 0;
	}
	goto L99;
 L8:
	if (ot) {
		voibuf[4] = 1;
	}
	goto L99;
 L10:
	if (voice[2] < -voice[1]) {
		voibuf[5] = 0;
	} else {
		voibuf[4] = 1;
	}
	goto L99;
 L11:
	voibuf[4] = 1;
	goto L99;
 L13:
	if (voibuf[7] == 0 && voice[3] < -voice[2]) {
		voibuf[6] = 0;
	} else {
		voibuf[5] = 1;
	}
	goto L99;
 L14:
	if (ot && voibuf[7] == 0) {
		voibuf[5] = 0;
	}
/* 	GOTO 99 */
 L99:
/*   Now update parameters: */
/*   ---------------------- */

/*  During unvoiced half-frames, update the low band and full band unvoice
d*/
/*   energy estimates (LBUE and FBUE) and also the zero crossing */
/*   threshold (DITHER).  (The input to the unvoiced energy filters is */
/*   restricted to be less than 10dB above the previous inputs of the */
/*   filters.) */
/*   During voiced half-frames, update the low-pass (LBVE) and all-pass */
/*   (FBVE) voiced energy estimates. */
	if (voibuf[*half + 6] == 0) {
/* Computing MIN */
		i__1 = fbe, i__2 = *ofbue * 3;
		r__1 = (*sfbue * 63 + (min(i__1, i__2) << 3)) / 64.f;
		*sfbue = i_nint(&r__1);
		*fbue = *sfbue / 8;
		*ofbue = fbe;
/* Computing MIN */
		i__1 = lbe, i__2 = *olbue * 3;
		r__1 = (*slbue * 63 + (min(i__1, i__2) << 3)) / 64.f;
		*slbue = i_nint(&r__1);
		*lbue = *slbue / 8;
		*olbue = lbe;
	} else {
		r__1 = (*lbve * 63 + lbe) / 64.f;
		*lbve = i_nint(&r__1);
		r__1 = (*fbve * 63 + fbe) / 64.f;
		*fbve = i_nint(&r__1);
	}
/*   Set dither threshold to yield proper zero crossing rates in the */
/*   presence of low frequency noise and low level signal input. */
/*   NOTE: The divisor is a function of REF, the expected energies. */
/* Computing MIN */
/* Computing MAX */
	r__2 = (float)(sqrt((float)(*lbue * *lbve)) * 64 / 3000);
	r__1 = max(r__2, 1.f);
	*dither = min(r__1, 20.f);
/*   Voicing decisions are returned in VOIBUF. */
	return 0;
}				/* lpc10_voicin */
